{
    "ChatMaps": {
        "description": "ChatMaps is a web-based social networking service that allows users to connect to others in their local geographic area. It implements an interactable mapping utility to show general user locations relative to others, as well as a chat room feature that allows users to start public conversations based on any given topic. ChatMaps is primarily intended for use in densely populated areas, such as college campuses or metropolitan areas, so people of similar interests can start new conversations.",
        "img": "chatmaps.png",
        "github_user": "ChatMaps",
        "github_repo": "ChatMaps",
        "isPublic": true,
        "hasGitea": false,
        "hasGithub": true,
        "hasCustomPage": "chatmaps"
    },
    "Aviation Assistant V1": {
        "description": "The Aviation Assistant V1 is an all-in-one ADS-B processing device that includes an integrated touchscreen and speaker for on-the-go plane tracking.",
        "img": "aa1.png",
        "gitea_user": "npease",
        "gitea_repo": "AviationAssistant",
        "isPublic": true,
        "hasGitea": true,
        "hasGithub": false,
        "hasCustomPage": "aa1"
    },
    "Aviation Assistant V2": {
        "description": "The Aviation Assistant V2 is a revamped version of the Aviation Assistant sporting a larger battery/runtime in addition to a more portable footprint for use in the field.",
        "img": "aa2.png",
        "gitea_user": "npease",
        "gitea_repo": "AviationAssistantV2",
        "isPublic": true,
        "hasGitea": true,
        "hasGithub": false,
        "hasCustomPage": "aa2"
    },
    "Aubuchon Additional Register Tools": {
        "description": "The register tools are a suite of software developed for the Aubuchon Hardware company to aid in the updating of manual UPC lookup books as well as interfacing with the backend's pricing API to provide real time inventory, pricing, and product information. Due to the nature of this software, it is closed sourced.",
        "img": "aublogo.svg",
        "gitea_user": "npease",
        "gitea_repo": "Aubuchon-book-generator",
        "isPublic": false,
        "hasGitea": true,
        "hasGithub": false,
        "hasCustomPage": "aubuchon"
    },
    "Weather Satellite Imagery": {
        "description": "The Weather Satellite Imagery project is a project where I constructed and tested various antennas and software to receive and decode weather satellite imagery from NOAA and Meteor satellites. Various results from these transmissions are availiable online at this website!",
        "isPublic": true,
        "hasGitea": false,
        "hasGithub": true,
        "hasCustomPage": "weatherimg",
        "github_user": "npease18",
        "github_repo": "Satellite-Imagery-Uploads",
        "img": "satimg.jpg"
    },
    "Calculator Programming": {
        "description": "My first introduction to programming was by way of the Texas Instruments series of calculators. These taught me fundamentals in programming with languages such as TI-BASIC, ICE, and Assembly.",
        "gitea_user": "npease",
        "gitea_repo": "ti",
        "isPublic": false,
        "hasGitea": false,
        "hasGithub": false,
        "hasCustomPage": "calc"
    }
}